Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz8110ca80100.h
/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PB17P_PTC_DRV0                         _UINT32_(49)
#define MUX_PB17P_PTC_DRV0                         _UINT32_(15)
#define PINMUX_PB17P_PTC_DRV0                      ((PIN_PB17P_PTC_DRV0 << 16) | MUX_PB17P_PTC_DRV0)
#define PORT_PB17P_PTC_DRV0                        (_UINT32_(1) << 17)

#define PIN_PB16P_PTC_DRV1                         _UINT32_(48)
#define MUX_PB16P_PTC_DRV1                         _UINT32_(15)
#define PINMUX_PB16P_PTC_DRV1                      ((PIN_PB16P_PTC_DRV1 << 16) | MUX_PB16P_PTC_DRV1)
#define PORT_PB16P_PTC_DRV1                        (_UINT32_(1) << 16)

#define PIN_PB15P_PTC_DRV2                         _UINT32_(47)
#define MUX_PB15P_PTC_DRV2                         _UINT32_(15)
#define PINMUX_PB15P_PTC_DRV2                      ((PIN_PB15P_PTC_DRV2 << 16) | MUX_PB15P_PTC_DRV2)
#define PORT_PB15P_PTC_DRV2                        (_UINT32_(1) << 15)

#define PIN_PB14P_PTC_DRV3                         _UINT32_(46)
#define MUX_PB14P_PTC_DRV3                         _UINT32_(15)
#define PINMUX_PB14P_PTC_DRV3                      ((PIN_PB14P_PTC_DRV3 << 16) | MUX_PB14P_PTC_DRV3)
#define PORT_PB14P_PTC_DRV3                        (_UINT32_(1) << 14)

#define PIN_PB13P_PTC_DRV4                         _UINT32_(45)
#define MUX_PB13P_PTC_DRV4                         _UINT32_(15)
#define PINMUX_PB13P_PTC_DRV4                      ((PIN_PB13P_PTC_DRV4 << 16) | MUX_PB13P_PTC_DRV4)
#define PORT_PB13P_PTC_DRV4                        (_UINT32_(1) << 13)

#define PIN_PB12P_PTC_DRV5                         _UINT32_(44)
#define MUX_PB12P_PTC_DRV5                         _UINT32_(15)
#define PINMUX_PB12P_PTC_DRV5                      ((PIN_PB12P_PTC_DRV5 << 16) | MUX_PB12P_PTC_DRV5)
#define PORT_PB12P_PTC_DRV5                        (_UINT32_(1) << 12)

#define PIN_PB11P_PTC_DRV6                         _UINT32_(43)
#define MUX_PB11P_PTC_DRV6                         _UINT32_(15)
#define PINMUX_PB11P_PTC_DRV6                      ((PIN_PB11P_PTC_DRV6 << 16) | MUX_PB11P_PTC_DRV6)
#define PORT_PB11P_PTC_DRV6                        (_UINT32_(1) << 11)

#define PIN_PB10P_PTC_DRV7                         _UINT32_(42)
#define MUX_PB10P_PTC_DRV7                         _UINT32_(15)
#define PINMUX_PB10P_PTC_DRV7                      ((PIN_PB10P_PTC_DRV7 << 16) | MUX_PB10P_PTC_DRV7)
#define PORT_PB10P_PTC_DRV7                        (_UINT32_(1) << 10)

#define PIN_PB09P_PTC_DRV8                         _UINT32_(41)
#define MUX_PB09P_PTC_DRV8                         _UINT32_(15)
#define PINMUX_PB09P_PTC_DRV8                      ((PIN_PB09P_PTC_DRV8 << 16) | MUX_PB09P_PTC_DRV8)
#define PORT_PB09P_PTC_DRV8                        (_UINT32_(1) << 9)

#define PIN_PB08P_PTC_DRV9                         _UINT32_(40)
#define MUX_PB08P_PTC_DRV9                         _UINT32_(15)
#define PINMUX_PB08P_PTC_DRV9                      ((PIN_PB08P_PTC_DRV9 << 16) | MUX_PB08P_PTC_DRV9)
#define PORT_PB08P_PTC_DRV9                        (_UINT32_(1) << 8)

#define PIN_PB07P_PTC_DRV10                        _UINT32_(39)
#define MUX_PB07P_PTC_DRV10                        _UINT32_(15)
#define PINMUX_PB07P_PTC_DRV10                     ((PIN_PB07P_PTC_DRV10 << 16) | MUX_PB07P_PTC_DRV10)
#define PORT_PB07P_PTC_DRV10                       (_UINT32_(1) << 7)

#define PIN_PB06P_PTC_DRV11                        _UINT32_(38)
#define MUX_PB06P_PTC_DRV11                        _UINT32_(15)
#define PINMUX_PB06P_PTC_DRV11                     ((PIN_PB06P_PTC_DRV11 << 16) | MUX_PB06P_PTC_DRV11)
#define PORT_PB06P_PTC_DRV11                       (_UINT32_(1) << 6)

#define PIN_PC02P_PTC_ECI0                         _UINT32_(66)
#define MUX_PC02P_PTC_ECI0                         _UINT32_(15)
#define PINMUX_PC02P_PTC_ECI0                      ((PIN_PC02P_PTC_ECI0 << 16) | MUX_PC02P_PTC_ECI0)
#define PORT_PC02P_PTC_ECI0                        (_UINT32_(1) << 2)

#define PIN_PC03P_PTC_ECI1                         _UINT32_(67)
#define MUX_PC03P_PTC_ECI1                         _UINT32_(15)
#define PINMUX_PC03P_PTC_ECI1                      ((PIN_PC03P_PTC_ECI1 << 16) | MUX_PC03P_PTC_ECI1)
#define PORT_PC03P_PTC_ECI1                        (_UINT32_(1) << 3)

/* ========== PORT definition for SDMMC0 peripheral ========== */
#define PIN_PC15I_SDMMC0_SDCD                      _UINT32_(79)
#define MUX_PC15I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PC15I_SDMMC0_SDCD                   ((PIN_PC15I_SDMMC0_SDCD << 16) | MUX_PC15I_SDMMC0_SDCD)
#define PORT_PC15I_SDMMC0_SDCD                     (_UINT32_(1) << 15)

#define PIN_PC08I_SDMMC0_SDCK                      _UINT32_(72)
#define MUX_PC08I_SDMMC0_SDCK                      _UINT32_(8) 
#define PINMUX_PC08I_SDMMC0_SDCK                   ((PIN_PC08I_SDMMC0_SDCK << 16) | MUX_PC08I_SDMMC0_SDCK)
#define PORT_PC08I_SDMMC0_SDCK                     (_UINT32_(1) << 8)

#define PIN_PC13I_SDMMC0_SDCMD                     _UINT32_(77)
#define MUX_PC13I_SDMMC0_SDCMD                     _UINT32_(8) 
#define PINMUX_PC13I_SDMMC0_SDCMD                  ((PIN_PC13I_SDMMC0_SDCMD << 16) | MUX_PC13I_SDMMC0_SDCMD)
#define PORT_PC13I_SDMMC0_SDCMD                    (_UINT32_(1) << 13)

#define PIN_PC09I_SDMMC0_SDDAT0                    _UINT32_(73)
#define MUX_PC09I_SDMMC0_SDDAT0                    _UINT32_(8) 
#define PINMUX_PC09I_SDMMC0_SDDAT0                 ((PIN_PC09I_SDMMC0_SDDAT0 << 16) | MUX_PC09I_SDMMC0_SDDAT0)
#define PORT_PC09I_SDMMC0_SDDAT0                   (_UINT32_(1) << 9)

#define PIN_PC10I_SDMMC0_SDDAT1                    _UINT32_(74)
#define MUX_PC10I_SDMMC0_SDDAT1                    _UINT32_(8) 
#define PINMUX_PC10I_SDMMC0_SDDAT1                 ((PIN_PC10I_SDMMC0_SDDAT1 << 16) | MUX_PC10I_SDMMC0_SDDAT1)
#define PORT_PC10I_SDMMC0_SDDAT1                   (_UINT32_(1) << 10)

#define PIN_PC11I_SDMMC0_SDDAT2                    _UINT32_(75)
#define MUX_PC11I_SDMMC0_SDDAT2                    _UINT32_(8) 
#define PINMUX_PC11I_SDMMC0_SDDAT2                 ((PIN_PC11I_SDMMC0_SDDAT2 << 16) | MUX_PC11I_SDMMC0_SDDAT2)
#define PORT_PC11I_SDMMC0_SDDAT2                   (_UINT32_(1) << 11)

#define PIN_PC12I_SDMMC0_SDDAT3                    _UINT32_(76)
#define MUX_PC12I_SDMMC0_SDDAT3                    _UINT32_(8) 
#define PINMUX_PC12I_SDMMC0_SDDAT3                 ((PIN_PC12I_SDMMC0_SDDAT3 << 16) | MUX_PC12I_SDMMC0_SDDAT3)
#define PORT_PC12I_SDMMC0_SDDAT3                   (_UINT32_(1) << 12)

#define PIN_PC14I_SDMMC0_SDWP                      _UINT32_(78)
#define MUX_PC14I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PC14I_SDMMC0_SDWP                   ((PIN_PC14I_SDMMC0_SDWP << 16) | MUX_PC14I_SDMMC0_SDWP)
#define PORT_PC14I_SDMMC0_SDWP                     (_UINT32_(1) << 14)

/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PC00D_SERCOM0_PAD0                     _UINT32_(64)
#define MUX_PC00D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PC00D_SERCOM0_PAD0                  ((PIN_PC00D_SERCOM0_PAD0 << 16) | MUX_PC00D_SERCOM0_PAD0)
#define PORT_PC00D_SERCOM0_PAD0                    (_UINT32_(1) << 0)

#define PIN_PC01D_SERCOM0_PAD1                     _UINT32_(65)
#define MUX_PC01D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PC01D_SERCOM0_PAD1                  ((PIN_PC01D_SERCOM0_PAD1 << 16) | MUX_PC01D_SERCOM0_PAD1)
#define PORT_PC01D_SERCOM0_PAD1                    (_UINT32_(1) << 1)

