Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz8110ca80100.h
#define PIN_PC02D_SERCOM0_PAD2                     _UINT32_(66)
#define MUX_PC02D_SERCOM0_PAD2                     _UINT32_(3) 
#define PINMUX_PC02D_SERCOM0_PAD2                  ((PIN_PC02D_SERCOM0_PAD2 << 16) | MUX_PC02D_SERCOM0_PAD2)
#define PORT_PC02D_SERCOM0_PAD2                    (_UINT32_(1) << 2)

#define PIN_PC03D_SERCOM0_PAD3                     _UINT32_(67)
#define MUX_PC03D_SERCOM0_PAD3                     _UINT32_(3) 
#define PINMUX_PC03D_SERCOM0_PAD3                  ((PIN_PC03D_SERCOM0_PAD3 << 16) | MUX_PC03D_SERCOM0_PAD3)
#define PORT_PC03D_SERCOM0_PAD3                    (_UINT32_(1) << 3)

/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_PC04D_SERCOM1_PAD0                     _UINT32_(68)
#define MUX_PC04D_SERCOM1_PAD0                     _UINT32_(3) 
#define PINMUX_PC04D_SERCOM1_PAD0                  ((PIN_PC04D_SERCOM1_PAD0 << 16) | MUX_PC04D_SERCOM1_PAD0)
#define PORT_PC04D_SERCOM1_PAD0                    (_UINT32_(1) << 4)

#define PIN_PC20D_SERCOM1_PAD0                     _UINT32_(84)
#define MUX_PC20D_SERCOM1_PAD0                     _UINT32_(3) 
#define PINMUX_PC20D_SERCOM1_PAD0                  ((PIN_PC20D_SERCOM1_PAD0 << 16) | MUX_PC20D_SERCOM1_PAD0)
#define PORT_PC20D_SERCOM1_PAD0                    (_UINT32_(1) << 20)

#define PIN_PC05D_SERCOM1_PAD1                     _UINT32_(69)
#define MUX_PC05D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PC05D_SERCOM1_PAD1                  ((PIN_PC05D_SERCOM1_PAD1 << 16) | MUX_PC05D_SERCOM1_PAD1)
#define PORT_PC05D_SERCOM1_PAD1                    (_UINT32_(1) << 5)

#define PIN_PC19D_SERCOM1_PAD1                     _UINT32_(83)
#define MUX_PC19D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PC19D_SERCOM1_PAD1                  ((PIN_PC19D_SERCOM1_PAD1 << 16) | MUX_PC19D_SERCOM1_PAD1)
#define PORT_PC19D_SERCOM1_PAD1                    (_UINT32_(1) << 19)

#define PIN_PC06D_SERCOM1_PAD2                     _UINT32_(70)
#define MUX_PC06D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PC06D_SERCOM1_PAD2                  ((PIN_PC06D_SERCOM1_PAD2 << 16) | MUX_PC06D_SERCOM1_PAD2)
#define PORT_PC06D_SERCOM1_PAD2                    (_UINT32_(1) << 6)

#define PIN_PC18D_SERCOM1_PAD2                     _UINT32_(82)
#define MUX_PC18D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PC18D_SERCOM1_PAD2                  ((PIN_PC18D_SERCOM1_PAD2 << 16) | MUX_PC18D_SERCOM1_PAD2)
#define PORT_PC18D_SERCOM1_PAD2                    (_UINT32_(1) << 18)

#define PIN_PC07D_SERCOM1_PAD3                     _UINT32_(71)
#define MUX_PC07D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PC07D_SERCOM1_PAD3                  ((PIN_PC07D_SERCOM1_PAD3 << 16) | MUX_PC07D_SERCOM1_PAD3)
#define PORT_PC07D_SERCOM1_PAD3                    (_UINT32_(1) << 7)

#define PIN_PC17D_SERCOM1_PAD3                     _UINT32_(81)
#define MUX_PC17D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PC17D_SERCOM1_PAD3                  ((PIN_PC17D_SERCOM1_PAD3 << 16) | MUX_PC17D_SERCOM1_PAD3)
#define PORT_PC17D_SERCOM1_PAD3                    (_UINT32_(1) << 17)

/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_PC08D_SERCOM2_PAD0                     _UINT32_(72)
#define MUX_PC08D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PC08D_SERCOM2_PAD0                  ((PIN_PC08D_SERCOM2_PAD0 << 16) | MUX_PC08D_SERCOM2_PAD0)
#define PORT_PC08D_SERCOM2_PAD0                    (_UINT32_(1) << 8)

#define PIN_PD11D_SERCOM2_PAD0                     _UINT32_(107)
#define MUX_PD11D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PD11D_SERCOM2_PAD0                  ((PIN_PD11D_SERCOM2_PAD0 << 16) | MUX_PD11D_SERCOM2_PAD0)
#define PORT_PD11D_SERCOM2_PAD0                    (_UINT32_(1) << 11)

#define PIN_PC09D_SERCOM2_PAD1                     _UINT32_(73)
#define MUX_PC09D_SERCOM2_PAD1                     _UINT32_(3) 
#define PINMUX_PC09D_SERCOM2_PAD1                  ((PIN_PC09D_SERCOM2_PAD1 << 16) | MUX_PC09D_SERCOM2_PAD1)
#define PORT_PC09D_SERCOM2_PAD1                    (_UINT32_(1) << 9)

#define PIN_PD12D_SERCOM2_PAD1                     _UINT32_(108)
#define MUX_PD12D_SERCOM2_PAD1                     _UINT32_(3) 
#define PINMUX_PD12D_SERCOM2_PAD1                  ((PIN_PD12D_SERCOM2_PAD1 << 16) | MUX_PD12D_SERCOM2_PAD1)
#define PORT_PD12D_SERCOM2_PAD1                    (_UINT32_(1) << 12)

#define PIN_PC10D_SERCOM2_PAD2                     _UINT32_(74)
#define MUX_PC10D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PC10D_SERCOM2_PAD2                  ((PIN_PC10D_SERCOM2_PAD2 << 16) | MUX_PC10D_SERCOM2_PAD2)
#define PORT_PC10D_SERCOM2_PAD2                    (_UINT32_(1) << 10)

#define PIN_PA04D_SERCOM2_PAD2                     _UINT32_(4) 
#define MUX_PA04D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PA04D_SERCOM2_PAD2                  ((PIN_PA04D_SERCOM2_PAD2 << 16) | MUX_PA04D_SERCOM2_PAD2)
#define PORT_PA04D_SERCOM2_PAD2                    (_UINT32_(1) << 4)

#define PIN_PC11D_SERCOM2_PAD3                     _UINT32_(75)
#define MUX_PC11D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PC11D_SERCOM2_PAD3                  ((PIN_PC11D_SERCOM2_PAD3 << 16) | MUX_PC11D_SERCOM2_PAD3)
#define PORT_PC11D_SERCOM2_PAD3                    (_UINT32_(1) << 11)

#define PIN_PA03D_SERCOM2_PAD3                     _UINT32_(3) 
#define MUX_PA03D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PA03D_SERCOM2_PAD3                  ((PIN_PA03D_SERCOM2_PAD3 << 16) | MUX_PA03D_SERCOM2_PAD3)
#define PORT_PA03D_SERCOM2_PAD3                    (_UINT32_(1) << 3)

/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_PC12D_SERCOM3_PAD0                     _UINT32_(76)
#define MUX_PC12D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PC12D_SERCOM3_PAD0                  ((PIN_PC12D_SERCOM3_PAD0 << 16) | MUX_PC12D_SERCOM3_PAD0)
#define PORT_PC12D_SERCOM3_PAD0                    (_UINT32_(1) << 12)

